const getMonthLength = (date) => {
  return parseInt((new Date().getTime() - new Date(date).getTime())/(1000 * 60 * 60 * 24 * 30)) + 1
}

export default [
  {
    type: 3,
    industry: "系统集成工程师",
    time: `20170315-至今(${getMonthLength('2017/03/15')}个月)`,
    ca: "自动驾驶/车路协同类",
    // hide: true,
    work: [
	    "【感知模块】熟练掌握双目视觉和imu的内外参标定方法",
	    "【感知模块】熟练掌握基于传统几何和基于深度学习的双目视差图和深度图的计算方法",
	    "【感知模块】熟练掌握3D lidar点云路面分割算法和聚类算法的实现原理",
	    "【感知模块】熟练掌握毫米波雷达和超声波雷达的特性及其语义数据的接入方法",
	    "【感知模块】熟练掌握车路协同中路端的融合感知数据和预测数据接入到车端的实现方法",
	    "【感知模块】熟练掌握中间件的开发，解析底层上报的raw data，然后提供统一接口给应用层",
	    "【车体模块】熟练掌握线控刹车/驻车的实现方法，了解线控转向的实现方法",
	    "【车体模块】油门，刹车标定表的制作",
	    "【车体模块】熟练对接前轮阿克曼转向和差速等不同结构的底盘",
	    "【定位模块】熟练掌握rtk（novatel oem718d, 和芯星通ub482，swift等）和ins（novatel pp7d）等作为基站，移动站的配置接入",
	    "【定位模块】熟练掌握lidar和rtk，lidar和ins之间的标定",
	    "【定位模块】了解基于msckf的VIO实现方案，以及VIO与GNSS的融合定位方法",
	    "【地图模块】初步了解Open Street Map的制作方法",
	    "【决策模块】初步了解A到B，全局固定路线，局部动态规划的决策实现",
	    "【数据统计模块】开发应用，统计车辆运营数据，包括运营实现，运营路线，接管次数等",
    ],
    money: "保密",
  },
  {
    type: 2,
    industry: "嵌入式软件开发工程师",
    time: "20150610-20161230",
    ca: "智能硬件/机器人",
    work: [
      "OTA升级，包括Android ROM升级，MCU固件升级",
      "TI CC2531 电源管理系统，云台控制，Zigbee协议栈的部署",
      "模块间通信，包括AP(MTK 6582, MTK 6753等)与MCU间的UART通信，上层的app与底层的service之间的通信",
      "基于Y-Modem协议的GD32固件（同时包括bootloader和app）升级",
      "低成本故事机方案的实现，可与用户进行语音对话，支持离线的语音唤醒和在线的语义识别",
    ],
    money: "保密",
  },
  {
    type: 1,
    industry: "Android apps/framework开发",
    time: "20120723-20150509",
    ca: "智能车载娱乐系统",
    work: [
      "基于Android系统的车辆恢复出厂设置，擦除Android data分区，恢复车辆的硬件（电动门锁，碰撞检测系统，座椅舒适度，空调等）",
      "车辆定制化的设置，包括门的落锁与解锁，空调设置，灯光设置等",
      "在Framework层新增CanLocationProvider，即经纬度信息来自车体的CAN bus",
      "语音版的邮件客户端，使用Nuance的语音合成/语音识别技术，完成一整套收发邮件的语音交互流程",
      "开发应用BugReporter，手机应用Crash log，打包上传到后台服务器",
    ],
    money: "保密",
  },
];
